export const MbtiAll = {
  E: {
    mbti: "E",
    main: "외향형",
    sub: "사교성이 뛰어나 폭 넓은 대인관계를 유지하고 있으며, 활동적인 자리를 좋아하고 매사 정렬적이다.",
    num: "first",
  },
  I: {
    mbti: "I",
    main: "내향형",
    sub: "소수와의 깊이 있는 대인관계를 유지하는 것을 좋아하는 편이며, 조용하고 신중하다. 어떤 사건이든 사전에 완벽히 인지한 후의 경험하는 것을 선호한다.",
    num: "first",
  },
  S: {
    mbti: "S",
    main: "감각형",
    sub: "오감에 의존하는 경향이 있으며 실제 경험을 중시한다. 현재에 초점을 맞추고 정확하고 철저하게 일처리를 하는 것이 큰 특징이다.",
    num: "second",
  },
  N: {
    mbti: "N",
    main: "직관형",
    sub: "육감 내지 영감에 의존하는 특징을 가지고 있으며, 미래지향적이다. 가능성과 의미추구, 신속, 비약적으로 일처리를 하는 겨향이 있다.",
    num: "second",
  },
  T: {
    mbti: "T",
    main: "사고형",
    sub: "진실과 사실에 주 관심을 두는 편이다. 논리적, 분석적, 객관적 판단을 중요하게 생각한다.",
    num: "third",
  },
  F: {
    mbti: "F",
    main: "감정형",
    sub: "사람과 관계에 주로 관심을 두는 편이다. 상황적, 정상을 참작한 설명을 중요시하다.",
    num: "third",
  },
  J: {
    mbti: "J",
    main: "판단형",
    sub: "분명한 목적과 방향을 추구하며, 기한 엄수 및 절저한 사전계획을 중점으로 체계적으로 일처리를 하는 것을 선호한다.",
    num: "fourth",
  },
  P: {
    mbti: "P",
    main: "인식형",
    sub: "목적과 방향을 유동성있게 변화시킬 수 있는 능력이 있으며 자율적이다. 상황에따라 융통성 있게 일정 변경이 가능하다.",
    num: "fourth",
  },
};
